#include "Force.h"

void ChickenAndRabbits()
{
	//只数相同，脚数都是三位数，且各位数不大于5
	//x:鸡
	//y:兔
	int x, y;
	int count = 0;

	//脚数都是三位数
	//if (2 * x >= 100 && 2 * x <= 999 && 4 * y >= 100 && 4 * y <= 999)
	//即2x >= 100，得 x >= 50, 2x < 1000，得x < 500
	//4y >= 100, y>= 25, 4y < 1000, 解得 y < 250
	//故此条件可由循环中的条件替代
	for (x = 50; x < 500; x++)
	{
		for (y = 25; y < 250; y++)
		{
			//只数相同
			if (x == y)
			{
				//各个位不大于5
				if (2*x / 100 >= 0 && 2*x / 100 <= 5 && 4*y / 100 >= 0 && 4*y / 100 <= 5)
				{
					if (2 * x / 10 % 10 <= 5 && 2 * x / 10 % 10 >= 0 && 4 * y / 10 % 10 <= 5 && 4 * y / 10 % 10 >= 0)
					{
						if (2 * x % 10 >= 0 && 2 * x % 10 <= 5 && 4 * y % 10 >= 0 && 4 * y % 10 <= 5)
						{
							cout << "方法" << ++count << ": " << endl;
							cout << "鸡：" << x << "鸡腿" << 2 * x << endl;
							cout << "兔：" << y << "兔腿" << 4 * y << endl;
						}
					}
			
				}
			}
		}
	}
}

//if (4 * y <= 500 && 4 * y % 100 <= 50 && 4 * y % 10 <= 5)
//{
//	if (2 * x <= 500 && 2 * x % 100 <= 50 && 2 * x % 10 <= 5)
//	{
//		cout << "方法" << ++count << ": " << endl;
//		cout << "鸡：" << x << "鸡腿" << 2 * x << endl;
//		cout << "兔：" << y << "兔腿" << 4 * y << endl;
//	}
//}
//各位数不大于5
//2*x <= 500 && 2*x % 100 <= 50 && 2*x % 10 <= 5
//4*y <= 500 && 4*y % 100 <= 50 && 4*y % 10 <= 5